## Lists

In [1]:
marks = [23, 15, 25, 13]
marks

[23, 15, 25, 13]

In [2]:
marks[0]

23

In [3]:
marks[1]

15

In [4]:
marks[-1]

13

In [5]:
marks[-2]

25

In [6]:
marks.append(17)
marks

[23, 15, 25, 13, 17]

In [7]:
marks.insert(0, 20)
marks

[20, 23, 15, 25, 13, 17]

In [8]:
marks.extend([15, 22, 9])
marks

[20, 23, 15, 25, 13, 17, 15, 22, 9]

In [9]:
# marks.remove(15)
# marks

In [10]:
# marks.pop(3)
# marks

In [11]:
marks.append(15)
marks

[20, 23, 15, 25, 13, 17, 15, 22, 9, 15]

In [12]:
# for i in range(3):
#     marks.remove(15)

# marks

In [13]:
15 in marks

True

In [14]:
33 in marks

False

In [15]:
# while 15 in marks:
#     marks.remove(15)
    
# marks

In [16]:
marks.index(13)

4

In [17]:
len(marks)

10

In [18]:
max(marks)

25

In [19]:
sum(marks) / len(marks)

17.4

In [20]:
marks.sort()
marks

[9, 13, 15, 15, 15, 17, 20, 22, 23, 25]

In [21]:
marks[0:3]

[9, 13, 15]

In [22]:
marks[:3]

[9, 13, 15]

In [23]:
marks[-3:]

[22, 23, 25]

---
## Tuples
> Immutable

In [24]:
days = ("Sun", "Mon", "Tue", "Wed", "Thu", "Fri")
days

('Sun', 'Mon', 'Tue', 'Wed', 'Thu', 'Fri')

In [25]:
days[0]

'Sun'

In [26]:
days[:3]

('Sun', 'Mon', 'Tue')

In [27]:
# days[0] = "Sunday"
# days

In [28]:
list(days)

['Sun', 'Mon', 'Tue', 'Wed', 'Thu', 'Fri']

---
## Dictionaries

In [29]:
# countries = ["Saudi Arabia", "Arab Emirates", "Egypt"]
countries = {
    "sa": "Saudi Arabia",
    "ae": "Arab Emirates",
    "eg": "Egypt"
}
countries

{'sa': 'Saudi Arabia', 'ae': 'Arab Emirates', 'eg': 'Egypt'}

In [30]:
countries["ae"]

'Arab Emirates'

In [31]:
countries["pl"] = "Palstine"
countries

{'sa': 'Saudi Arabia', 'ae': 'Arab Emirates', 'eg': 'Egypt', 'pl': 'Palstine'}

In [32]:
countries.update({"ku": "Kuwait"})
countries

{'sa': 'Saudi Arabia',
 'ae': 'Arab Emirates',
 'eg': 'Egypt',
 'pl': 'Palstine',
 'ku': 'Kuwait'}

In [33]:
countries["eg"] = "Republic of Egypt"
countries

{'sa': 'Saudi Arabia',
 'ae': 'Arab Emirates',
 'eg': 'Republic of Egypt',
 'pl': 'Palstine',
 'ku': 'Kuwait'}

In [34]:
# countries.pop("ae")
# countries

In [35]:
# del countries["eg"]
# countries

In [36]:
# countries.popitem()
# countries

In [37]:
list(countries.values())

['Saudi Arabia', 'Arab Emirates', 'Republic of Egypt', 'Palstine', 'Kuwait']

In [38]:
list(countries.keys())

['sa', 'ae', 'eg', 'pl', 'ku']

In [39]:
list(countries.items())

[('sa', 'Saudi Arabia'),
 ('ae', 'Arab Emirates'),
 ('eg', 'Republic of Egypt'),
 ('pl', 'Palstine'),
 ('ku', 'Kuwait')]

In [40]:
students = {
    "Ahmed": [23, 15, 22],
    "Ali": [19, 28, 25],
    "Wael": [15, 30, 29]
}

students

{'Ahmed': [23, 15, 22], 'Ali': [19, 28, 25], 'Wael': [15, 30, 29]}

In [41]:
students["Ali"]

[19, 28, 25]

In [42]:
students["Ali"][1]

28

---
## Loops

In [43]:
for i in range(5):
    print(i)

0
1
2
3
4

In [44]:
list(range(1, 10, 2))

[1, 3, 5, 7, 9]

In [45]:
list(range(1, 10))

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [46]:
list(range(10))

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [47]:
list(range(5))

[0, 1, 2, 3, 4]

In [48]:
salaries = [15000, 5000, 7000, 13000]
for sal in salaries:
    print(sal)

15000
5000
7000
13000

In [49]:
for sal in salaries:
    print(sal + 500)

15500
5500
7500
13500

In [50]:
for k in countries:
    print(k)

sa
ae
eg
pl
ku

In [51]:
for k in countries.values():
    print(k)

Saudi Arabia
Arab Emirates
Republic of Egypt
Palstine
Kuwait

In [52]:
for k, v in countries.items():
    print(k, "=>", v)

sa => Saudi Arabia
ae => Arab Emirates
eg => Republic of Egypt
pl => Palstine
ku => Kuwait

In [53]:
for k in countries.items():
    print(k)

('sa', 'Saudi Arabia')
('ae', 'Arab Emirates')
('eg', 'Republic of Egypt')
('pl', 'Palstine')
('ku', 'Kuwait')

In [54]:
msg = "Welocme to Python"
for ch in msg:
    print(ch)

W
e
l
o
c
m
e

t
o

P
y
t
h
o
n

In [55]:
x = 1
while x <= 10:
    print(x, end="\t")
    x += 1

1	2	3	4	5	6	7	8	9	10

In [56]:
salaries = []
# data = input("Enter a salary (or stop): ")
# while data != "stop":
#     data = eval(data)
#     salaries.append(data)
#     data = input("Enter a salary (of stop): ")

salaries

[]

---
## Comprehenshion

In [57]:
salaries

[]

In [58]:
# new_salaries = []
# for sal in salaries:
#     new_salaries.append(sal + 500)

# new_salaries

In [59]:
salaries = [s+500 for s in salaries]
salaries

[]

In [60]:
temp1 = [s+500 for s in salaries if s < 10000]
temp1

[]

In [61]:
salaries

[]

In [62]:
temp2 = [s+500 if s < 10000 else s  for s in salaries]
temp2

[]

In [63]:
nums = [1, 2, 3]
nums2 = [n*2 for n in nums]
nums2

[2, 4, 6]

In [64]:
#0599888921

In [65]:
list(set(marks))

[9, 13, 15, 17, 20, 22, 23, 25]

In [66]:
lstA = [13,15,-4,8,23,25,17,44,-7,-10,0,1,5,0,2,8,45]
strings = ['SK1908','RK1905','SB1001','GM1406','EL3005']
cities_A = ['Tokyo','Shanghai','Jakarta','Delhi','Seoul']
populations_A = [37.8,34.9,31.7,26.5,25.5]

In [67]:
postcode = []
for code in strings:
    postcode.append(code[:2])

postcode

['SK', 'RK', 'SB', 'GM', 'EL']

In [68]:
postcodes = [code[:2] for code in strings]
postcodes

['SK', 'RK', 'SB', 'GM', 'EL']

In [69]:
[n for n in lstA if n >= 0]

[13, 15, 8, 23, 25, 17, 44, 0, 1, 5, 0, 2, 8, 45]

In [70]:
[n*10 for n in lstA if n >= 0]

[130, 150, 80, 230, 250, 170, 440, 0, 10, 50, 0, 20, 80, 450]

In [71]:
[n*10 if n >= 0 else abs(n)  for n in lstA ]

[130, 150, 4, 80, 230, 250, 170, 440, 7, 10, 0, 10, 50, 0, 20, 80, 450]

In [72]:
# {13: "Positive", 15: "Positive", -4: "Negative", }

{n: "Positive" if n >= 0 else "Negative"  for n in lstA}

{13: 'Positive',
 15: 'Positive',
 -4: 'Negative',
 8: 'Positive',
 23: 'Positive',
 25: 'Positive',
 17: 'Positive',
 44: 'Positive',
 -7: 'Negative',
 -10: 'Negative',
 0: 'Positive',
 1: 'Positive',
 5: 'Positive',
 2: 'Positive',
 45: 'Positive'}

In [73]:
{c: len(c) for c in cities_A}

{'Tokyo': 5, 'Shanghai': 8, 'Jakarta': 7, 'Delhi': 5, 'Seoul': 5}

In [74]:
{
    c: p
    for c, p in zip(cities_A, populations_A)
}

{'Tokyo': 37.8,
 'Shanghai': 34.9,
 'Jakarta': 31.7,
 'Delhi': 26.5,
 'Seoul': 25.5}

In [75]:
{
    i+1 : c
    for i, c in enumerate(cities_A)
}

{1: 'Tokyo', 2: 'Shanghai', 3: 'Jakarta', 4: 'Delhi', 5: 'Seoul'}

In [76]:

{
    c: (i+1, p)
    for i, (c, p) in enumerate(zip(cities_A, populations_A))
}

{'Tokyo': (1, 37.8),
 'Shanghai': (2, 34.9),
 'Jakarta': (3, 31.7),
 'Delhi': (4, 26.5),
 'Seoul': (5, 25.5)}

## Numpy

In [77]:
# pip install numpy
import numpy as np

marks = np.array([23, 19, 18, 21])
type(marks)

numpy.ndarray

In [78]:
# [n + 2 for n in marks]

marks + 2

array([25, 21, 20, 23])

In [79]:
marks / 25 * 100

array([92., 76., 72., 84.])

In [80]:
marks.dtype

dtype('int32')

In [81]:
pct = marks / 25 * 100
pct

array([92., 76., 72., 84.])

In [82]:
pct.dtype

dtype('float64')

In [83]:
lst = np.array(["Omar", 23, 25, 19])
lst

array(['Omar', '23', '25', '19'], dtype='<U11')

In [84]:
# lst * 3

In [85]:
marks.max()

23

In [86]:
marks.min()

18

In [87]:
marks.mean()

20.25

In [88]:
# marks.median()

In [89]:
np.median(marks)

20.0

In [90]:
np.mean(marks)

20.25

## Pandas
### Series

In [91]:
import pandas as pd

marks = pd.Series([23, 13, 21, 18, 19])
marks

0    23
1    13
2    21
3    18
4    19
dtype: int64

In [92]:
marks[0]

23

In [93]:
marks[0:3]

0    23
1    13
2    21
dtype: int64

In [94]:
marks + 2

0    25
1    15
2    23
3    20
4    21
dtype: int64

In [95]:
marks / 25 * 100

0    92.0
1    52.0
2    84.0
3    72.0
4    76.0
dtype: float64

In [96]:
marks = pd.Series([23, 13, 21, 18, 19], 
                  index=["Ahmed", "Mohamed", "Ali", "Wael", "Yasser"])
marks

Ahmed      23
Mohamed    13
Ali        21
Wael       18
Yasser     19
dtype: int64

In [97]:
marks["Ali"]

21

In [98]:

marks["Ahmed": "Ali"]

Ahmed      23
Mohamed    13
Ali        21
dtype: int64

In [99]:
marks.max()

23

In [100]:
marks.mean()

18.8

In [101]:
marks.median()

19.0

In [102]:

marks.mode()

0    13
1    18
2    19
3    21
4    23
dtype: int64

In [103]:
more_marks = pd.Series({"Omar": 23, "Belal": 18, "Khalid": 18, "Baraa": 23})
marks = marks.append(more_marks)
marks

Ahmed      23
Mohamed    13
Ali        21
Wael       18
Yasser     19
Omar       23
Belal      18
Khalid     18
Baraa      23
dtype: int64

In [104]:
marks.mode()

0    18
1    23
dtype: int64

In [127]:
marks.describe()

count     5.000000
mean     18.800000
std       3.768289
min      13.000000
25%      18.000000
50%      19.000000
75%      21.000000
max      23.000000
dtype: float64

In [106]:
mask = marks > 20
marks[mask]

Ahmed    23
Ali      21
Omar     23
Baraa    23
dtype: int64

In [107]:
mask = (marks > 20) | (marks < 15)
marks[mask]

Ahmed      23
Mohamed    13
Ali        21
Omar       23
Baraa      23
dtype: int64

In [108]:
mask = ~(marks > 20)
marks[mask]

Mohamed    13
Wael       18
Yasser     19
Belal      18
Khalid     18
dtype: int64

In [109]:
marks.head()

Ahmed      23
Mohamed    13
Ali        21
Wael       18
Yasser     19
dtype: int64

In [110]:
marks.tail()

Yasser    19
Omar      23
Belal     18
Khalid    18
Baraa     23
dtype: int64

In [111]:
marks

Ahmed      23
Mohamed    13
Ali        21
Wael       18
Yasser     19
Omar       23
Belal      18
Khalid     18
Baraa      23
dtype: int64

In [112]:
marks.iloc[2]

21

### DataFrame

In [113]:
data = pd.read_csv("week2/day2/sales.csv")
data

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won
5,218895,Kulas Inc,Daniel Hilton,Debra Henley,CPU,2,40000,pending
6,218895,Kulas Inc,Daniel Hilton,Debra Henley,Software,1,10000,presented
7,412290,Jerde-Hilpert,John Smith,Debra Henley,Maintenance,2,5000,pending
8,740150,Barton LLC,John Smith,Debra Henley,CPU,1,35000,declined
9,141962,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000,won
10,163416,Purdy-Kunde,Cedric Moss,Fred Anderson,CPU,1,30000,presented
11,239344,Stokes LLC,Cedric Moss,Fred Anderson,Maintenance,1,5000,pending
12,239344,Stokes LLC,Cedric Moss,Fred Anderson,Software,1,10000,presented
13,307599,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000,won
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won
15,729833,Koepp Ltd,Wendy Yule,Fred Anderson,CPU,2,65000,declined
16,729833,Koepp Ltd,Wendy Yule,Fred Anderson,Monitor,2,5000,presented
17,123456,cosmos,neil,lucy,universe,1,"1,000,000",presented

In [114]:
data["Name"]

0                  Trantow-Barrows
1                  Trantow-Barrows
2                  Trantow-Barrows
3     Fritsch, Russel and Anderson
4                     Kiehn-Spinka
5                        Kulas Inc
6                        Kulas Inc
7                    Jerde-Hilpert
8                       Barton LLC
9                       Herman LLC
10                     Purdy-Kunde
11                      Stokes LLC
12                      Stokes LLC
13     Kassulke, Ondricka and Metz
14                     Keeling LLC
15                       Koepp Ltd
16                       Koepp Ltd
17                          cosmos
Name: Name, dtype: object

In [115]:
data[["Name", "Product", "Quantity", "Price"]]

                            Name      Product  Quantity      Price
0                Trantow-Barrows          CPU         1      30000
1                Trantow-Barrows     Software         1      10000
2                Trantow-Barrows  Maintenance         2       5000
3   Fritsch, Russel and Anderson          CPU         1      35000
4                   Kiehn-Spinka          CPU         2      65000
5                      Kulas Inc          CPU         2      40000
6                      Kulas Inc     Software         1      10000
7                  Jerde-Hilpert  Maintenance         2       5000
8                     Barton LLC          CPU         1      35000
9                     Herman LLC          CPU         2      65000
10                   Purdy-Kunde          CPU         1      30000
11                    Stokes LLC  Maintenance         1       5000
12                    Stokes LLC     Software         1      10000
13   Kassulke, Ondricka and Metz  Maintenance         3       7000
14                   Keeling LLC          CPU         5     100000
15                     Koepp Ltd          CPU         2      65000
16                     Koepp Ltd      Monitor         2       5000
17                        cosmos     universe         1  1,000,000

In [116]:
data[1:5]

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

In [117]:
data.loc[1:5, "Name": "Price"]

,Name,Rep,Manager,Product,Quantity,Price
1,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000
2,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000
3,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000
4,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000
5,Kulas Inc,Daniel Hilton,Debra Henley,CPU,2,40000

In [118]:
data.iloc[1:5, 1:7]

,Name,Rep,Manager,Product,Quantity,Price
1,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000
2,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000
3,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000
4,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000

In [119]:
data.iloc[:, 1:7]

,Name,Rep,Manager,Product,Quantity,Price
0,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000
1,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000
2,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000
3,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000
4,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000
5,Kulas Inc,Daniel Hilton,Debra Henley,CPU,2,40000
6,Kulas Inc,Daniel Hilton,Debra Henley,Software,1,10000
7,Jerde-Hilpert,John Smith,Debra Henley,Maintenance,2,5000
8,Barton LLC,John Smith,Debra Henley,CPU,1,35000
9,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000
10,Purdy-Kunde,Cedric Moss,Fred Anderson,CPU,1,30000
11,Stokes LLC,Cedric Moss,Fred Anderson,Maintenance,1,5000
12,Stokes LLC,Cedric Moss,Fred Anderson,Software,1,10000
13,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000
14,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000
15,Koepp Ltd,Wendy Yule,Fred Anderson,CPU,2,65000
16,Koepp Ltd,Wendy Yule,Fred Anderson,Monitor,2,5000
17,cosmos,neil,lucy,universe,1,"1,000,000"

In [120]:
mask = data["Product"] == "CPU"
data[mask]

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won
5,218895,Kulas Inc,Daniel Hilton,Debra Henley,CPU,2,40000,pending
8,740150,Barton LLC,John Smith,Debra Henley,CPU,1,35000,declined
9,141962,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000,won
10,163416,Purdy-Kunde,Cedric Moss,Fred Anderson,CPU,1,30000,presented
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won
15,729833,Koepp Ltd,Wendy Yule,Fred Anderson,CPU,2,65000,declined

In [121]:
mask = data["Quantity"] > 3
data[mask]

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won

In [122]:
data.head()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

In [123]:
data.tail()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
13,307599,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000,won
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won
15,729833,Koepp Ltd,Wendy Yule,Fred Anderson,CPU,2,65000,declined
16,729833,Koepp Ltd,Wendy Yule,Fred Anderson,Monitor,2,5000,presented
17,123456,cosmos,neil,lucy,universe,1,"1,000,000",presented

In [124]:
data.describe()

             Account   Quantity
count      18.000000  18.000000
mean   443432.111111   1.722222
std    263737.607563   1.017815
min    123456.000000   1.000000
25%    218895.000000   1.000000
50%    359944.500000   1.500000
75%    714466.000000   2.000000
max    740150.000000   5.000000

In [125]:
data.describe(include="all")

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
count,18.000000,18,18,18,18,18.000000,18,18
unique,NaN,13,6,3,5,NaN,9,4
top,NaN,Trantow-Barrows,Craig Booker,Debra Henley,CPU,NaN,5000,presented
freq,NaN,3,4,9,9,NaN,4,7
mean,443432.111111,NaN,NaN,NaN,NaN,1.722222,NaN,NaN
std,263737.607563,NaN,NaN,NaN,NaN,1.017815,NaN,NaN
min,123456.000000,NaN,NaN,NaN,NaN,1.000000,NaN,NaN
25%,218895.000000,NaN,NaN,NaN,NaN,1.000000,NaN,NaN
50%,359944.500000,NaN,NaN,NaN,NaN,1.500000,NaN,NaN
75%,714466.000000,NaN,NaN,NaN,NaN,2.000000,NaN,NaN
max,740150.000000,NaN,NaN,NaN,NaN,5.000000,NaN,NaN

In [126]:
data["Quantity"].mean()

1.7222222222222223